[
  {
    "id": 37,
    "orgId": 70,
    "experience": "2",
    "roleName": "UX Designer",
    "displayOnWeb": true,
    "roleDiscription": "Responsible for functional design solutions creating better product experiences. The broad responsibility of a UX designer is to ensure that the product logically flows from one step to the next. \n\nRoles & Responsibilities:\nGather information about users and step into their shoes by developing empathy and understanding.\nUnderstand the business requirements and overall goals of a project.\nDevelop a flow, a plan, and break down the various user journeys that are required to achieve the best possible experience.\nCommunicate and collaborate with stakeholders and internal teams to help them understand design concepts.\nHave a good eye for detail and always try to simplify a user’s experience.\n\n\nSkills:\nUnderstanding of UX principles and methodologies.\nAbility to take feedback and design inputs.\nSkilled at rapid prototyping, UX research, developing wireframes, creating product mock-ups, analyzing business processes.\nUnderstanding of Web and mobile Ux best practices\nExperience in prototyping -  Figma\nDegree in any Design discipline (Interaction Design preferred)\n",
    "key": "Ik+7ZN8r8eIWsUxDpw01AQ=="
  },
  {
    "id": 39,
    "orgId": 70,
    "experience": "1",
    "roleName": "UI Designer",
    "displayOnWeb": true,
    "roleDiscription": "A creative individual is responsible for creating the aesthetic look and feel of a\nproduct by using standard design principles and practices.\n\nRoles & Responsibilities:\nEstablish the visual identity of a project and create interfaces/screens as per the requirements.\nSetup or work within a UI guideline which will ensure the uniformity and standardization of a brand’s vision and style.\nDesign reusable UI components, graphics, icons, infographics, and logos.\nCollaborate with stakeholders and UX designers to understand the flow and needs of a user.\nWork closely with developers and inspect the quality of the designs.\n\nSkills:\nGood knowledge of colors, typography, visual aesthetics, layout, and white space.\nExperience with software like Adobe XD, Sketch, and Figma.\nAbility to develop new and fresh UI keeping simplicity a priority.\nHandle and reflect on design feedback.\nBring identity to every design work.\nA strong design portfolio showcasing your design skills\n",
    "key": "wABaDt0ISjsbJ7cYDoL1Eg=="
  },
  {
    "id": 40,
    "orgId": 70,
    "experience": "2",
    "roleName": "UI Engineer - React",
    "displayOnWeb": true,
    "roleDiscription": "UI Engineer who can take the designer’s pixels to codes using the latest UI programming languages. We are looking for candidates who believe in design and are ready to adapt to the latest UI technologies and standards.\n\nRoles & Responsibilities:\nTranslation of the UI/UX design wireframes to actual code that will produce visual elements of the application.\nDetermining the structure and design of web pages.\nEnsuring user experience determines design choices.\nEnsure the technical feasibility of UI/UX designs.\nDeveloping features to enhance the user experience.\nStriking a balance between functional and aesthetic design.\nEnsuring web design is optimized for smartphones, tablets, laptops, PCs, etc.\nBuilding reusable code and libraries for future use.\nOptimizing web pages for maximum speed and scalability.\nUtilizing a variety of markup languages to write web pages.\nMaintaining brand consistency throughout the design.\nSkills:\nA Frontend Developer, excellent in HTML5, CSS3, Responsive design, JavaScript and Bootstrap framework, \nComponent-based development using popular Javascript frameworks like React JS, Angular JS etc\nComfortable both working within an existing code base and writing code from scratch.\nExcellent problem solving, design, and debugging skills.\n",
    "key": "61OLjtEmt/Mm1sKHcIkquQ=="
  },
  {
    "id": 47,
    "orgId": 70,
    "experience": "2",
    "roleName": "Project Manager",
    "displayOnWeb": true,
    "roleDiscription": "An experienced person who can take the lead of managing a design team while \nmaintaining the project’s requirements.\n\nRoles and Responsibilities:\nUnderstand the project and business goals to plan the strategy to achieve the desired result.\nDrive the entire project from initial design stages to final delivery.\nSet up meetings with clients to ensure smooth to and fro on the delivery of the project. \nDevelop quick wireframes and prototypes and collaborate with other designers and stakeholders. \nHave track of the progress and asset files of every project.\n\nSkills:\nProven experience in managing design projects.\nExpert in standard design practices, methodologies, and user thinking.\nHave a good eye for design and details. \nGood communication and presentation skills\n",
    "key": "2Tw+WTYute5T6hB/TYtFEg=="
  },
  {
    "id": 49,
    "orgId": 70,
    "experience": "2",
    "roleName": "Digital Marketing Specialist",
    "displayOnWeb": true,
    "roleDiscription": " You will be working as a part of the Digital Marketing & Campaign team focusing on planning, executing, tracking and analysis of direct marketing campaigns. This team will be responsible for the entire lifecycle of a marketing campaign, from inception to launch to the evaluation of results.\n\nRoles & Responsibilities:\nDrive more visitors to the corporate brand website using various content marketing strategies\nWrite blog articles to drive traffic to the website.\nGenerate leads using various social channels, industry research etc.\nPrepare pitch decks for various services that we offer.\nDesign, build and maintain our social media presence.\nMeasure and report performance of all digital marketing campaigns, and assess against goals (ROI and KPIs)\nBrainstorm new and creative growth strategies\nUtilize the strong analytical ability to evaluate end-to-end customer experience across multiple channels and customer touchpoints.\n\nSkills:\nProven experience in leading and managing SEO/SEM, marketing database, email, social media, and/or display advertising campaigns.\nGood knowledge of website analytics tools (e.g., Google Analytics, NetInsight, Omniture, WebTrends)\nStrong analytical skills and data-driven thinking.\nUp-to-date with the latest trends and best practices in online marketing and measurement\nAbility to include a fun/quirky factor in any type of marketing campaign to grab the attention of a customer/user.\n",
    "key": "fTKvM+5Kbsh8CGEoMiYhLg=="
  },
  {
    "id": 50,
    "orgId": 70,
    "experience": "2",
    "roleName": "UX Intern",
    "displayOnWeb": true,
    "roleDiscription": "Responsible for functional design solutions creating better product experiences. The broad responsibility of a UX Intern is to assist senior designers and ensure that the product logically flows from one step to the next. \n\nRoles & Responsibilities:\nGather information about users and step into their shoes by developing empathy and understanding.\nUnderstand the business requirements and overall goals of a project.\nDevelop a flow, a plan, and break down the various user journeys that are required to achieve the best possible experience.\nCommunicate with stakeholders and internal teams to help them understand design concepts.\nHave a good eye for detail and always try to simplify a user’s experience.\nShould be available for minimum 6 Months\n\n\nSkills:\nUnderstanding of design principles and methodologies.\nAbility to take feedback and design inputs.\nSkilled with figma.\nUnderstanding of Web and mobile Ux best practices.\nBachelor's Degree\n",
    "key": "9bR6n/NKwwlc5hyebW0vMA=="
  },
  {
    "id": 51,
    "orgId": 70,
    "experience": "2",
    "roleName": "UI Engineer(Angular)",
    "displayOnWeb": true,
    "roleDiscription": "UI Engineer who can take the designer’s pixels to codes using the latest UI programming languages. We are looking for candidates who believe in design and are ready to adapt to the latest UI technologies and standards.\n\nRoles & Responsibilities:\nTranslation of the UI/UX design wireframes to actual code that will produce visual elements of the application.\nDetermining the structure and design of web pages.\nEnsuring user experience determines design choices.\nEnsure the technical feasibility of UI/UX designs.\nDeveloping features to enhance the user experience.\nStriking a balance between functional and aesthetic design.\nEnsuring web design is optimized for smartphones, tablets, laptops, PCs, etc.\nBuilding reusable code and libraries for future use.\nOptimizing web pages for maximum speed and scalability.\nUtilizing a variety of markup languages to write web pages.\nMaintaining brand consistency throughout the design.\nSkills:\nA Frontend Developer, excellent in HTML5, CSS3, Responsive design, JavaScript and Bootstrap framework, \nComponent-based development using popular Javascript frameworks like React JS, Angular JS etc\nComfortable both working within an existing code base and writing code from scratch.\nExcellent problem solving, design, and debugging skills.\n",
    "key": "/80itYeZX5mLRS7Vllb/PQ=="
  },
  {
    "id": 55,
    "orgId": 70,
    "experience": "5",
    "roleName": "UX Manager",
    "displayOnWeb": true,
    "roleDiscription": "Responsible for functional design solutions creating better product experiences. The broad responsibility of a UX Manager is to ensure that the product logically flows from one step to the next. \n\nRoles & Responsibilities:\n\nGather information about users and step into their shoes by developing empathy and understanding.\nDevelop the strategic plans for the UX team.\nLead and mentor direct reports, make hiring decisions for the team, and help individuals improve by providing feedback on research and design work.\nShare your design expertise across the organization\nUnderstand the business requirements and overall goals of a project.\nDevelop a flow, a plan, and break down the various user journeys that are required to achieve the best possible experience.\nCommunicate and collaborate with stakeholders and internal teams to help them understand design concepts.\nHave a good eye for detail and always try to simplify a user’s experience.\nBuild and maintain team values and a positive team culture\nManage projects and deadlines for the team\nPrioritize and assign work to the team while ensuring deadlines are met and manageable.\n\nSkills:\nUnderstanding of UX principles and methodologies.\nAbility to take feedback and design inputs.\nUnderstanding of Web and mobile Ux best practices.\nProficiency in design and prototyping tools such as Sketch, Figma, Adobe Creative Suite, or similar.\nExperience with B2B & B2C project design delivery experience\nExperience with handling International Clients presales to delivery\nBe an expert on all aspects of UX research and design including:\nInformation architecture: Organizing pages and information within a website or app so that it is navigable and accessible\nPrototypes: Building simplified versions of a working feature or product to investigate problems and validate solutions\nResearch: Collecting and analyzing inputs such as behavioral data and customer feedback\nTesting: Examining whether solutions are working as intended\nVisual design: Understanding how elements like colors, font, images, and layout impact user experience\nWireframes: Designing blueprints that demonstrate how a solution works before displaying how it will look\nDegree in any Design discipline (Interaction Design preferred)\n",
    "key": "+cyD7hJK4HCIRAZRaMUmbg=="
  },
  {
    "id": 66,
    "orgId": 70,
    "experience": "4",
    "roleName": "Lead UX Designer ",
    "displayOnWeb": true,
    "roleDiscription": "Guide and mentor the UX & UI team members, provide feedback, and ensure that the output is delivered with good quality\nWork with visual designers and engineering teams. Lead/Facilitate learning and coach a team of UI/ UX Designers.\nRun Design standups, capable of handling multiple projects simultaneously creating user-centric designs based on customer feedback and usability findings.\nUnderstand user perspectives by actively listening, observing, communicating, and limiting assumptions.\nApply design thinking principles to empathize with users, document findings from the user interviews, work with the project team to formulate good user journeys, and prepare wireframes based on the above considerations to ensure that user needs are captured, and validated with customers and that the expectations are communicated well to the project team.\nConduct research using different methods (qualitative, quantitative, behavioral, in-person user research, etc.) to understand more about the customer, and identify the key users of the system \nPrepare questionnaires, run workshops, and conduct interviews with customers & key stakeholders, to understand both stated and unstated needs, challenges, and preferences on how they intend to interact with the system.\nWork with the stakeholders and the team to plan and prioritize the product backlog, ensure that the product backlog is well defined, and that requirements meet the Definition of Ready (DoR) before they are considered for development.\nValidate and test features to ensure that user requirements are met before they are demonstrated or delivered to the customer.\nAttend/facilitate pre-sales calls.\nDevelop visual style and quality bar of the UI by creating appealing and high-quality app interfaces to present a unique clear visual identity across multiple platforms including web, iOS, and Android.\nDesign detailed wireframes with clear user journeys, information architecture, interaction flow, and interaction models, user flow/process flows.\nLow and high-fidelity design mock-ups to effectively conceptualize and communicate high-level design strategies and detailed interaction behavior\nProduce deliverables including presentations, graphic designs, wireframes, interactive prototypes, usability reports, design specs, etc.\nEffectively sell design solutions to cross-functional teams and stakeholders through design storytelling and by demonstrating traceability in design thinking.\nParticipate in UX documentation & publish design-specific articles to the wider community.\n\nSkills/Requirements:\nStrong experience in designing and delivering complex, interactive, large-scale design projects.\nExcellent problem-solving and design skills\nAbility to interpret user problems within the context of the product/business and detailed findings into actionable design recommendations and solutions.\nAbility to work  & guide multi-ethnic cross-functional teams as a  mentor\nGood communication, presentation skills, and experience will help manage clients independently\nA good understanding of Graphic & UX Design principles\nHands-on experience with the design process of software services or software products\nKnowledge of software development life cycle (SDLC) and methodologies\nFamiliar with the latest global design trends\nUx writing skills will have an added advantage\nA bachelor in design will be preferred\n",
    "key": "nBrOqVdhlmn7ADBkTizCnQ=="
  },
  {
    "id": 78,
    "orgId": 70,
    "experience": "1",
    "roleName": "Graphic Design Intern ",
    "displayOnWeb": true,
    "roleDiscription": "Seeking a talented and self-motivated Graphic Design Intern to join our creative team. The ideal candidate will be passionate about design, possess a keen eye for detail, and be proficient in various design and animation tools. This is an excellent opportunity to gain hands-on experience and contribute to our digital and print marketing efforts.\n\nKey Responsibilities\n\nGraphic Design\nCreate visually appealing graphics for blogs, social media posts, newsletters, and event collaterals.\n\nVideo Production\nDevelop engaging videos and reels for social media platforms to enhance our online presence and audience engagement.\n\nCollaboration\nWork closely with the marketing and content teams to ensure designs align with brand guidelines and project requirements.\n\nTimely Delivery\nManage multiple design projects simultaneously and deliver high-quality outputs within stipulated deadlines.\n\nInnovation\nStay updated with the latest design trends and tools to continuously bring fresh and creative ideas.\n\n\nRequirements\n\nDesign Sensitivity\nStrong sense of aesthetics and attention to detail.\n\nSoftware Proficiency\nWell-versed in design software such as Photoshop, Illustrator, and Figma. Experience with video animations tools like Adobe After Effects is an added advantage.\n\nAdaptability\nAbility to work under guidelines and direction provided by the team.\n\nTime Management\nStrong organizational skills to handle multiple projects and meet deadlines.\n\n\nPreferred Qualifications\n\nPrevious experience or internships in graphic design.\nPortfolio showcasing a range of graphic design projects.\nKnowledge of social media trends and best practices.\n\n\nWhy Join Us\nOpportunity to work in a dynamic and creative environment.\nGain valuable hands-on experience in graphic design and video production.\nCollaborate with a passionate and supportive team.\nContribute to exciting projects and initiatives.\n\n\nIf you are enthusiastic about design and eager to learn and grow, we would love to hear from you. Apply now and be a part of our creative journey!\n",
    "key": "vVXzWIm4L4Dh90BieZ3ZQQ=="
  },
  {
    "id": 88,
    "orgId": 70,
    "experience": "2",
    "roleName": "Full Stack Developer",
    "displayOnWeb": true,
    "roleDiscription": "Create and develop applications/systems based on wireframes and product requirement documents, ensuring alignment with business objectives.\nLead both back-end and front-end development using technologies such as React.js,Node.js, MongoDB, Express, and Redux.\nWrite unit tests to ensure code robustness, covering edge cases, usability, and overall reliability.\nDevelop reusable, maintainable, and versioned code adhering to DRY principles.\nIntegrate existing tools and business systems, including in-house tools, to streamline operations.\nDemonstrate proficiency in creating dynamic, responsive web pages.\nHave a solid understanding of Server-Oriented Architecture and RESTful Web Services.\nMentor junior team members on system architecture, and coding practices, and encourage a culture of continuous improvement.\n\nWhat Makes You a Great Fit:\nProblem-Solving: Strong analytical and problem-solving skills, with a deep understanding of data structures and algorithms.\nEagerness to Learn: A strong desire for responsibility and a thirst for knowledge, continuously seeking to expand your expertise.\nPassion for Excellence: A passion for building robust, failure-resistant systems, with a commitment to maintaining high coding standards.\nQuality Advocate: A proactive advocate for quality software, ensuring that issues are promptly identified and resolved.\nAPI Integration: Experience with RESTful APIs to connect front-end components to back-end services.\nCloud Messaging & Deployment: Experience with cloud messaging APIs and push notifications, preferably Firebase, and proficiency in container-based application deployment using Docker or similar technologies.\nCloud Platforms: Familiarity with at least one cloud platform, such as AWS, GCP, Azure, or Digital Ocean. Experience with the GraphQL ecosystem is a plus.\nMust-Have Skill Sets:\nProficiency in Fullstack, JavaScript, and  jQuery",
    "key": "wD6vxm1V6IyAy8FpOuc8Cw=="
  },
  {
    "id": 112,
    "orgId": 70,
    "experience": "2",
    "roleName": "Freelance Sales executive",
    "displayOnWeb": true,
    "roleDiscription": "Source potential leads through various channels, including online portals, databases, LinkedIn, and freelance platforms.\nDevelop a thorough understanding of the Company's products, services, and target audience.\nFocus on generating high-quality leads, including those interested in demos, portfolios, detailed discussions, or direct conversions.\nConduct pre-sales calls to initiate conversations and assess lead potential.\nOrganize lead details (emails, phone numbers, LinkedIn profiles) for follow-up.\nContact leads to gather insights and assess interest while checking their availability for capacity demos.\nConduct follow-up calls for leads requesting later engagement.\nMaintain accurate records of all lead activities in a Google document.\nProvide daily and weekly reports on lead generation and conversion progress to the team.\n",
    "key": "Ok1JccHJBrQGKrUOHWZBlw=="
  },
  {
    "id": 115,
    "orgId": 70,
    "experience": "1",
    "roleName": "Junior Python Developer",
    "displayOnWeb": true,
    "roleDiscription": "Job Title: Junior Python Developer \n\nExperience: 1+ yrs\nEmployment Type: Full-Time\nEducation: B.Tech CS / IT or related\n\nKey Responsibilities: \n\nDevelop, debug, and maintain Python applications, scripts, and APIs.\nSupport the design and implementation of AI/ML models for predictive analytics, NLP, or computer vision.\nCollaborate with the cross-functional team to integrate machine learning models into production systems.\nWork with data preprocessing, cleaning, and feature engineering for ML workflows.\nWrite clean, efficient, and reusable code following best practices.\nContribute to documentation, code reviews, and knowledge sharing within the team.\nStay updated with emerging Python frameworks, AI/ML tools, and industry trends.\n\nRequired Skills & Qualifications:\n\nBachelor’s degree in Computer Science, IT, Data Science, or related field.\nMinimum 1 year of hands-on experience in Python development.\nStrong understanding of Python libraries such as NumPy, Pandas, Matplotlib, and Scikit-learn.\nExposure in working with OpenAI, Lambda, etc \nExposure to AI/ML frameworks such as TensorFlow / PyTorch / Keras.\nKnowledge of NLP, deep learning, or computer vision techniques.\nFamiliarity with REST APIs, Flask/FastAPI, or Django.\nUnderstanding of version control (Git) and collaborative development practices.\nStrong problem-solving, analytical thinking, and eagerness to learn new technologies.\n\n\n",
    "key": "04klcl6waeQUO4s9hOEn8g=="
  }
]
